[
  {
    "front": "🧩 Data Mining\n📘 Domain: Data Science",
    "back": "**Definition:** The process of finding previously unknown and potentially interesting patterns and relationships in large databases through statistical and algorithmic methods.\n\n**Description:** Data mining automates the extraction of knowledge from data and involves descriptive, predictive, and explanatory modeling. It simplifies and automates the statistical process from data sources to model application, supporting manual and automated methods.\n\n**Goal:** Discover patterns, relationships, and insights from large datasets.\n**Applications:** Customer segmentation, Fraud detection, Recommendation systems\n**Methods:** Classification, Clustering, Regression, Association analysis\n**Challenges:** Data quality, Scalability, Interpretability"
  },
  {
    "front": "🧩 Knowledge Discovery in Databases\n📘 Domain: Data Science",
    "back": "**Definition:** The overall process of discovering useful knowledge from data, including data selection, cleaning, transformation, mining, and interpretation.\n\n**Description:** KDD integrates data mining as a core step and emphasizes interpretation, prior knowledge, and iterative improvement. It transforms raw data into actionable knowledge through systematic analysis.\n\n**Steps:** Data selection, Data cleaning, Data transformation, Data mining, Pattern evaluation, Knowledge representation\n**Applications:** Scientific discovery, Business intelligence, Engineering analytics"
  },
  {
    "front": "🧩 Data Pre-processing\n📘 Domain: Data Science",
    "back": "**Definition:** The step of preparing raw data for mining by cleaning, transforming, integrating, and reducing it to improve quality and usability.\n\n**Description:** Data pre-processing deals with incomplete, noisy, or inconsistent data, improving accuracy and ensuring that models are built correctly. It converts raw data into suitable forms for mining and analysis.\n\n**Tasks:** Data cleaning, Data integration, Data transformation, Data reduction, Data discretization\n**Benefits:** Improved data quality, Reduced noise, Higher model accuracy\n**Problems addressed:** Missing values, Outliers, Inconsistencies, Bias"
  },
  {
    "front": "🧩 Data Quality\n📘 Domain: Data Management",
    "back": "**Definition:** A measure of the condition of data based on factors such as accuracy, completeness, reliability, and relevance.\n\n**Description:** High-quality data ensures valid and actionable analysis. Characteristics include accuracy, precision, completeness, timeliness, consistency, and reliability.\n\n**Characteristics:** Accuracy and precision, Completeness, Availability and accessibility, Timeliness and relevance, Granularity, Reliability and consistency\n**Risks:** Inaccurate models, Faulty decision-making, Unreliable analytics"
  },
  {
    "front": "🧩 Data Cleaning\n📘 Domain: Data Science",
    "back": "**Definition:** The process of detecting and correcting inaccurate or corrupt data to improve data quality.\n\n**Description:** Data cleaning involves handling missing values, removing noise, identifying outliers, and correcting inconsistencies using statistical or algorithmic methods.\n\n**Methods:** Imputation, Binning, Clustering-based outlier removal, Regression smoothing\n**Goals:** Ensure data accuracy, Reduce noise, Improve model performance"
  },
  {
    "front": "🧩 Big Data\n📘 Domain: Data Science",
    "back": "**Definition:** Extremely large data sets that can be analyzed computationally to reveal patterns, trends, and associations, especially relating to human behavior and interactions.\n\n**Description:** Big Data is characterized by the 5Vs: Volume, Velocity, Variety, Veracity, and Value. It requires specialized tools and techniques for storage, processing, and analysis.\n\n**Characteristics:** Volume, Velocity, Variety, Veracity, Value\n**Challenges:** Scalability, Quality assurance, Privacy"
  },
  {
    "front": "🧩 Data Literacy\n📘 Domain: Education",
    "back": "**Definition:** The ability to read, understand, create, and communicate data as information.\n\n**Description:** Data literacy enables individuals and organizations to use data effectively, supporting evidence-based decision making and fostering a data-driven culture.\n\n**Components:** Reading and interpreting data, Communicating insights, Applying statistical reasoning, Understanding data ethics\n**Relevance:** Data science, Business analytics, Policy making"
  },
  {
    "front": "🧩 Data Transformation\n📘 Domain: Data Science",
    "back": "**Definition:** The process of converting data into a suitable format for analysis or mining.\n\n**Description:** Transformation includes normalization, aggregation, generalization, and feature extraction, making the data compatible with mining algorithms.\n\n**Techniques:** Normalization, Standardization, Feature extraction, Aggregation\n**Goals:** Ensure consistency, Enhance interpretability, Prepare for modeling"
  },
  {
    "front": "🧩 Data Reduction\n📘 Domain: Data Science",
    "back": "**Definition:** The process of reducing the volume of data while maintaining its analytical value.\n\n**Description:** Data reduction techniques simplify data without losing critical information, enabling efficient analysis and storage.\n\n**Methods:** Sampling, Aggregation, Principal Component Analysis, Clustering\n**Purpose:** Reduce computational cost, Improve scalability"
  },
  {
    "front": "🧩 Data Ethics\n📘 Domain: Data Science",
    "back": "**Definition:** A set of moral guidelines and practices governing responsible collection, analysis, and use of data, ensuring respect for privacy, transparency, and fairness.\n\n**Description:** Data ethics involves acting responsibly with the data entrusted to you. It acknowledges that data often represent people, and therefore, misuse can harm individuals or groups. Ethical data mining requires accountability, honesty, and consideration of the potential consequences of analysis outcomes.\n\n**Motives:** Ensure positive social impact, Avoid manipulation, Promote fairness\n**Methods:** Transparency, Accountability, Consent\n**Consequences:** Respect privacy, Prevent harm, Foster trust"
  },
  {
    "front": "🧩 Ethical Data Mining\n📘 Domain: Data Science",
    "back": "**Definition:** The practice of conducting data mining in a way that is fair, transparent, and respects privacy and consent.\n\n**Description:** Ethical data mining balances the potential benefits of insights gained from data with the responsibility to protect subjects from harm. It considers ownership, consent, data sensitivity, and the possible implications of findings.\n\n**Key Principles:** Honesty, Transparency, Responsibility, Non-maleficence\n**Challenges:** Unintended harm, Biased data, Lack of consent"
  },
  {
    "front": "🧩 Informed Consent\n📘 Domain: Research Ethics",
    "back": "**Definition:** The process of obtaining voluntary, informed permission from individuals whose data will be collected or used.\n\n**Description:** Informed consent ensures individuals understand what data is collected, how it will be used, and have the freedom to withdraw at any time. It is fundamental in research involving personal or sensitive data.\n\n**Requirements:** Clear explanation of purpose, Freedom to deny or withdraw, Comprehensible to the participant\n**Constraints:** Use only for stated purpose, Respect withdrawal, Maintain anonymity"
  },
  {
    "front": "🧩 General Data Protection Regulation (GDPR)\n📘 Domain: European Data Protection",
    "back": "**Definition:** A European Union regulation that governs data protection and privacy for individuals within the EU and EEA.\n\n**Description:** GDPR defines the lawful basis for data processing, grants rights to data subjects, and imposes obligations on data controllers and processors. It aims to give individuals control over their personal data and harmonize regulations across the EU.\n\n**Principles:** Lawfulness, Fairness, Transparency, Data minimisation, Accountability\n**Rights:** Access, Erasure, Portability, Restriction\n**Sanctions:** Fines for breaches, Data protection impact assessments"
  },
  {
    "front": "🧩 Information Security\n📘 Domain: Data Management",
    "back": "**Definition:** The practice of protecting information from unauthorized access, modification, or destruction to ensure confidentiality, integrity, and availability.\n\n**Description:** Information security ensures that data remains accurate, private, and accessible only to authorized users. The CIA triad—Confidentiality, Integrity, Availability—summarizes its key principles.\n\n**Core Principles:** Confidentiality, Integrity, Availability\n**Threats:** Hardware failure, Malware, Human error, Unauthorized access\n**Practices:** Encryption, Backups, Access control, Authentication"
  },
  {
    "front": "🧩 Information Privacy\n📘 Domain: Data Protection",
    "back": "**Definition:** The right and ability of individuals to control the collection, use, and dissemination of information about themselves.\n\n**Description:** Information privacy goes beyond the absence of surveillance—it concerns individuals’ control over personal information traces in digital society. Data mining poses unique challenges to privacy preservation.\n\n**Threats:** Data theft, Unethical use, Government surveillance, Lack of awareness\n**Protective Measures:** Anonymisation, Pseudonymisation, Access control"
  },
  {
    "front": "🧩 Anonymisation\n📘 Domain: Data Privacy",
    "back": "**Definition:** The process of removing personally identifiable information from data to prevent the identification of individuals.\n\n**Description:** Anonymisation ensures that personal data cannot be traced back to individuals, even when combined with external data. It is critical in ethical data mining and required for many research use cases.\n\n**Methods:** Suppression, Generalisation, K-anonymity, Randomization\n**Challenges:** Re-identification risk, Data utility loss"
  },
  {
    "front": "🧩 Open Data\n📘 Domain: Data Management",
    "back": "**Definition:** Data that anyone can freely access, use, modify, and share for any purpose, subject at most to minimal conditions such as attribution.\n\n**Description:** Open data promotes transparency, innovation, and collaboration. It must be findable, accessible, interoperable, and reusable according to the FAIR principles.\n\n**Principles:** Findable, Accessible, Interoperable, Reusable\n**Licenses:** CC0, CC BY, ODbL\n**Challenges:** Loss of control, Licensing complexity, Data misuse"
  },
  {
    "front": "🧩 FAIR Principles\n📘 Domain: Open Science",
    "back": "**Definition:** A set of guidelines to make data Findable, Accessible, Interoperable, and Reusable.\n\n**Description:** The FAIR principles ensure data can be easily located, accessed, integrated, and reused by others, supporting open science and reproducibility.\n\n**Components:** Findable, Accessible, Interoperable, Reusable\n**Benefits:** Transparency, Data sharing, Reproducibility"
  },
  {
    "front": "🧩 Data Management\n📘 Domain: Data Science",
    "back": "**Definition:** The set of practices that ensure data is properly stored, maintained, and accessible for processing and analysis.\n\n**Description:** Data management encompasses persistent storage, security, metadata curation, and accessibility. Proper management ensures reliability and longevity of data for research and applications.\n\n**Aspects:** Storage, Curation, Security, Metadata\n**Tools:** Relational Databases, NoSQL Systems"
  }
]